Repository: skouerr/skouerr-cli
Catalog: lang/skouerr-cli-*.po
Languages: fr_fr

source: CLI for Skouerr (Good version)
fr_fr: CLI de Skouerr

# Desciption of the command `wp skouerr make:post-type`
source: Create a new post type in the theme
fr_fr: Créer un nouveau post-type dans le thème

# Description for the command `wp skouerr make:theme`
source: Create a new theme in themes directory
fr_fr: Créer un nouveau thème dans le dossier des thèmes

# Description of the `wp skouerr list` command
source: Display the commands used by Skouerr cli
fr_fr: Afficher les commandes utilisées par Skouerr CLI

# Description of the command `wp skouerr import:block`
source: Import a block in the theme
fr_fr: Importer un bloc dans le thème

# Description of the command `wp skouerr list:blocks`
source: List all blocks in the theme
fr_fr: Lister tous les blocks du thème.

# Description of the command `wp skouerr make:block`
source: Create a new block in the theme
fr_fr: Créer un nouveau bloc dans le thème

# Description of the command `wp skouerr make:template`
source: Create a new template in the theme
fr_fr: Créer une nouvelle template dans le thème

# Description of the command `wp skouerr save:template`
source: Save a template in the theme
fr_fr: Sauvegarder une template dans le thème

# Header of the blocs table
source: category
fr_fr: Catégorie

# Header of the blocs table
source: icon
fr_fr: Icône

# Header of the blocs table
source: name
fr_fr: Nom

# Header of the blocs table
source: title
fr_fr: Titre

# Header of the command `wp skouerr list`
source: Command name
fr_fr: Nom de la commande

# Header of the command `wp skouerr list`
source: Title
fr_fr: Titre

# Input choice of the command `wp skouerr make:block`
source: ACF (needs ACF Pro)
fr_fr: ACF (requiert ACF Pro)

# Input of the command `wp skouerr make:block`
source: Do you confirm creation of block ?
fr_fr: Veuillez confirmer la création du bloc :

# Input of the command `wp skouerr make:block`
source: Enter the dashicon of the block (https://developer.wordpress.org/resource/dashicons)
fr_fr: Entrez le dashicon du bloc (https://developer.wordpress.org/resource/dashicons)

# Input of the command `wp skouerr make:block`
source: Enter the name of the block
fr_fr: Entrez le nom du bloc

# Input of the command `wp skouerr make:block`
source: Select the prefix
fr_fr: Sélectionnez le préfix

# Input of the command `wp skouerr make:block`
source: Select the template
fr_fr: Sélectionnez la template

# Input of the command `wp skouerr make:block`
source: Select the type of block
fr_fr: Sélectionnez le type de bloc

# Input of the command `wp skouerr make:post-type`
source: Enter the domain of the post type
fr_fr: Entrez le domaine du post-type

# Input of the command `wp skouerr make:post-type`
source: Enter the icon of the post type
fr_fr: Entrez l'icône du post-type

# Input of the command `wp skouerr make:post-type`
source: Enter the label of the post type
fr_fr: Entrez le label du post-type

# Input of the command `wp skouerr make:post-type`
source: Enter the slug of the post type
fr_fr: Entrez le slug du post-type

# Input of the command `wp skouerr make:template`
source: Enter the name of the template
fr_fr: Entrez le nom de la template

# Input of the command `wp skouerr make:theme`
source: Enter the name of the theme
fr_fr: Entrez le nom du thème

# Input of the command `wp skouerr make:theme`
source: Enter the text domain of the theme
fr_fr: Entrez le text domain du thème

# Input of the command `wp skouerr make:theme`
source: Enter the title of the theme
fr_fr: Entrez le titre du thème

# Input of the command `wp skouerr save:pattern`.
source: Select a pattern
fr_fr: Sélectionnez un modèle

# Input of the command `wp skouerr save:template`
source: Select a template
fr_fr: Sélectionnez une template

source: Invalid parameters. $cli_name and $commands cannot be null.
fr_fr: Paramètres invalides. Les paramètres $cli_name et $commands ne peuvent pas être null.

# Log for the command `wp skouerr make:block`
source: Block created successfully
fr_fr: Le bloc a été créé avec succès

# Log message for the command `wp skouerr save:template`
source: No template found
fr_fr: Aucune template n'a été trouvée

# Log message of the command `wp skouerr make:theme`
source: Error downloading theme
fr_fr: Une erreur s'est produite lors du téléchargement du thème

# Log message of the command `wp skouerr make:theme`.
source: Composer dependencies installed
fr_fr: Les dépendances de composer ont été installées.

# Log message of the command `wp skouerr make:theme`.
source: Error downloading theme
fr_fr: Une erreur s'est produite lors du téléchargement du thème

# Log message of the command `wp skouerr make:theme`.
source: Error unzipping theme
fr_fr: Une erreur s'est produite lors du dézippage du thème

# Log message of the command `wp skouerr make:theme`.
source: Install composer dependencies ...
fr_fr: Installation des dépendances de composer...

# Log message of the command `wp skouerr make:theme`.
source: Start Downloading theme ...
fr_fr: Démarrage du téléchargement du thème...

# Log message of the command `wp skouerr make:theme`.
source: Start unzipping theme ...
fr_fr: Démarrage du dézippage du thème...

# Log message of the command `wp skouerr make:theme`.
source: Switching to theme ...
fr_fr: Définition du thème...

# Log message of the command `wp skouerr make:theme`.
source: Theme created successfully, enjoy!
fr_fr: Thème créé avec succès, amusez-vous bien !

# Log message of the command `wp skouerr make:theme`.
source: Theme downloaded
fr_fr: Thème téléchargé

# Log message of the command `wp skouerr make:theme`.
source: Theme switched
fr_fr: Thème définit

# Log message of the command `wp skouerr make:theme`.
source: Theme unzipped
fr_fr: Thème dézippé

# Log of the command `wp skouerr list`
source: An error occurred while retrieving commands: %s
fr_fr: Une erreur s'est produite lors de la récupération des commandes : %s

# Log of the command `wp skouerr list`
source: List of commands used by the skouerr cli plugin
fr_fr: Liste des commandes utilisées par le plugin Skouerr CLI

# Log of the command `wp skouerr make:block`
source: Icon:
fr_fr: Icône:

# Log of the command `wp skouerr make:block`
source: Name:
fr_fr: Nom:

# Log of the command `wp skouerr make:block`
source: Title:
fr_fr: Titre:

# Log of the command `wp skouerr make:block`
source: Block creation aborted
fr_fr: La création du bloc a été annulée

# Log of the command `wp skouerr make:block`
source: Confirm the following information:
fr_fr: Confirmez les informations suivantes :

# Log of the command `wp skouerr make:block`
source: This template is not available
fr_fr: Cette template n'est pas disponible

# Log of the command `wp skouerr make:post-type`
source: Post type %s created
fr_fr: Post-type %s créé

# Log of the command `wp skouerr make:template`
source: Template created
fr_fr: Template créé

# Log of the command `wp skouerr save:pattern`
source: No patterns in database found
fr_fr: Modèle introuvable dans la base de donnée

# Log of the command `wp skouerr save:pattern`. %s correspond to the pattern name.
source: Pattern %s saved
fr_fr: Modèle %s sauvegardée

# Log of the command `wp skouerr save:template`. %s correspond to the template.
source: Template %s saved
fr_fr: Template %s sauvegardée

source: no
fr_fr: non

source: This command is not implemented yet
fr_fr: Cette commande n'est pas encore implémentée

# Title of the command `wp skouerr import:block`
source: Import block
fr_fr: Importer un bloc

# Title of the command `wp skouerr list:blocks`
source: List blocks
fr_fr: Lister des blocs

# Title of the command `wp skouerr list`
source: List of commands
fr_fr: Lister les commandes

# Title of the command `wp skouerr make:block`
source: Make a block
fr_fr: Créer un bloc

# Title of the command `wp skouerr make:post-type`
source: Make a post type
fr_fr: Faire un post-type

# Title of the command `wp skouerr make:template`
source: Make a template
fr_fr: Faire une template

# Title of the command `wp skouerr make:theme`
source: Make a theme
fr_fr: Faire un thème

# Title of the command `wp skouerr save:pattern`
source: Save a pattern
fr_fr: Sauvegarder un modèle

# Title of the command `wp skouerr save:pattern`
source: Save a pattern in the theme
fr_fr: Sauvegarder un modèle dans le thème

# Title of the command `wp skouerr save:template`
source: Save a template
fr_fr: Sauvegarder une template

source: yes
fr_fr: oui
